feat: add dnsenum mode and docs
